# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. 
# Она растёт на круглой грядке, причём кусты высажены только по окружности.
# Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растёт N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора
# на них выросло различное число ягод — на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом,
# собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод,
# которое может собрать за один заход собирающий модуль,
# находясь перед некоторым кустом заданной во входном файле грядки.

from random import randint
n = int(input("Сколько кустов на грядке? "))

lst = [i + randint(20, 40) for i in range(n)]
print(lst)

counter = 0
summ = 0

for item in lst:
    summ += item
    counter += 1
    if counter == 3:
        print(f"Модуль собрал -> {summ}" )
        summ = 0
        counter = 0

if summ:
    print(f"Модуль собрал -> {summ}" )